info = {
    "name": "am",
    "date_order": "DMY",
    "january": [
        "ጃንዩ",
        "ጃንዩወሪ"
    ],
    "february": [
        "ፌብሩ",
        "ፌብሩወሪ"
    ],
    "march": [
        "ማርች"
    ],
    "april": [
        "ኤፕሪ",
        "ኤፕሪል"
    ],
    "may": [
        "ሜይ"
    ],
    "june": [
        "ጁን"
    ],
    "july": [
        "ጁላይ"
    ],
    "august": [
        "ኦገስ",
        "ኦገስት"
    ],
    "september": [
        "ሴፕቴ",
        "ሴፕቴምበር"
    ],
    "october": [
        "ኦክቶ",
        "ኦክቶበር"
    ],
    "november": [
        "ኖቬም",
        "ኖቬምበር"
    ],
    "december": [
        "ዲሴም",
        "ዲሴምበር"
    ],
    "monday": [
        "ሰኞ"
    ],
    "tuesday": [
        "ማክሰ",
        "ማክሰኞ"
    ],
    "wednesday": [
        "ረቡዕ"
    ],
    "thursday": [
        "ሐሙስ"
    ],
    "friday": [
        "ዓርብ"
    ],
    "saturday": [
        "ቅዳሜ"
    ],
    "sunday": [
        "እሑድ"
    ],
    "am": [
        "ጥዋት"
    ],
    "pm": [
        "ከሰዓት"
    ],
    "year": [
        "ዓመት"
    ],
    "month": [
        "ወር"
    ],
    "week": [
        "ሳምንት"
    ],
    "day": [
        "ቀን"
    ],
    "hour": [
        "ሰዓት"
    ],
    "minute": [
        "ደቂቃ"
    ],
    "second": [
        "ሰከንድ"
    ],
    "relative-type": {
        "0 day ago": [
            "ዛሬ"
        ],
        "0 hour ago": [
            "ይህ ሰዓት"
        ],
        "0 minute ago": [
            "ይህ ደቂቃ"
        ],
        "0 month ago": [
            "በዚህ ወር"
        ],
        "0 second ago": [
            "አሁን"
        ],
        "0 week ago": [
            "በዚህ ሣምንት",
            "በዚህ ሳምንት"
        ],
        "0 year ago": [
            "በዚህ ዓመት"
        ],
        "1 day ago": [
            "ትላንትና",
            "ትናንት"
        ],
        "1 month ago": [
            "ያለፈው ወር"
        ],
        "1 week ago": [
            "ባለፈው ሳምንት",
            "ያለፈው ሳምንት"
        ],
        "1 year ago": [
            "ያለፈው ዓመት"
        ],
        "in 1 day": [
            "ነገ"
        ],
        "in 1 month": [
            "የሚቀጥለው ወር"
        ],
        "in 1 week": [
            "የሚቀጥለው ሳምንት"
        ],
        "in 1 year": [
            "የሚቀጥለው ዓመት"
        ]
    },
    "relative-type-regex": {
        "\\1 day ago": [
            "ከ (\\d+[.,]?\\d*) ቀን በፊት",
            "ከ(\\d+[.,]?\\d*) ቀናት በፊት",
            "ከ(\\d+[.,]?\\d*) ቀን በፊት",
            "ከ(\\d+[.,]?\\d*) ቀኖች በፊት"
        ],
        "\\1 hour ago": [
            "ከ(\\d+[.,]?\\d*) ሰዓት በፊት",
            "ከ(\\d+[.,]?\\d*) ሰዓቶች በፊት"
        ],
        "\\1 minute ago": [
            "ከ(\\d+[.,]?\\d*) ደቂቃ በፊት",
            "ከ(\\d+[.,]?\\d*) ደቂቃዎች በፊት"
        ],
        "\\1 month ago": [
            "ከ(\\d+[.,]?\\d*) ወራት በፊት",
            "ከ(\\d+[.,]?\\d*) ወር በፊት"
        ],
        "\\1 second ago": [
            "ከ(\\d+[.,]?\\d*) ሰከንድ በፊት",
            "ከ(\\d+[.,]?\\d*) ሰከንዶች በፊት"
        ],
        "\\1 week ago": [
            "ከ(\\d+[.,]?\\d*) ሳምንታት በፊት",
            "ከ(\\d+[.,]?\\d*) ሳምንት በፊት"
        ],
        "\\1 year ago": [
            "ከ(\\d+[.,]?\\d*) ዓመታት በፊት",
            "ከ(\\d+[.,]?\\d*) ዓመት በፊት"
        ],
        "in \\1 day": [
            "በ(\\d+[.,]?\\d*) ቀናት ውስጥ",
            "በ(\\d+[.,]?\\d*) ቀን ውስጥ",
            "በ(\\d+[.,]?\\d*) ቀኖች ውስጥ"
        ],
        "in \\1 hour": [
            "በ(\\d+[.,]?\\d*) ሰዓት ውስጥ",
            "በ(\\d+[.,]?\\d*) ሰዓቶች ውስጥ"
        ],
        "in \\1 minute": [
            "በ(\\d+[.,]?\\d*) ደቂቃ ውስጥ",
            "በ(\\d+[.,]?\\d*) ደቂቃዎች ውስጥ"
        ],
        "in \\1 month": [
            "በ(\\d+[.,]?\\d*) ወራት ውስጥ",
            "በ(\\d+[.,]?\\d*) ወር ውስጥ"
        ],
        "in \\1 second": [
            "በ(\\d+[.,]?\\d*) ሰከንድ ውስጥ",
            "በ(\\d+[.,]?\\d*) ሰከንዶች ውስጥ"
        ],
        "in \\1 week": [
            "በ(\\d+[.,]?\\d*) ሳምንታት ውስጥ",
            "በ(\\d+[.,]?\\d*) ሳምንት ውስጥ"
        ],
        "in \\1 year": [
            "በ(\\d+[.,]?\\d*) ዓመታት ውስጥ"
        ]
    },
    "locale_specific": {},
    "skip": [
        " ",
        "'",
        ",",
        "-",
        ".",
        "/",
        ";",
        "@",
        "[",
        "]",
        "|",
        "，"
    ]
}
